
const validateRules = {
    positive_integer : {
        pattern: /^(0|[1-9]\d*)$/,
        name: '正整数',
        rule:  { pattern: /^(0|[1-9]\d*)$/, message: '格式不正确，请输入正整数'}
    },
    positive_number : {
        pattern: /^(0|[1-9]\d*)(\.\d+)?$/,
        name: '正数',
        rule:  { pattern: /^(0|[1-9]\d*)(\.\d+)?$/, message: '格式不正确，请输入正数'}
    },
    number : {
        pattern: /^-?(0|[1-9]\d*)(\.\d+)?$/,
        name: '数字',
        rule:  { pattern: /^-?(0|[1-9]\d*)(\.\d+)?$/, message: '格式不正确，请输入数字'}
    },
    cellphone : {
        pattern: /^(13[0-9]|14[01456879]|15[0-35-9]|16[2567]|17[0-8]|18[0-9]|19[0-35-9])\d{8}$/,
        name: '手机号',
        rule: { pattern: /^(13[0-9]|14[01456879]|15[0-35-9]|16[2567]|17[0-8]|18[0-9]|19[0-35-9])\d{8}$/, message: '手机号格式不正确，请重新输入' }
    },
    email : {
        // pattern: /^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$/,
        pattern: /^(([^<>()\[\]\\.,;:\s@"]+(\.[^<>()\[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/,
        name: '邮箱',
        rule: { pattern: /^(([^<>()\[\]\\.,;:\s@"]+(\.[^<>()\[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/, message: '邮箱格式不正确，请重新输入' }
    },
    postalCode : {
        pattern: /^\d{6}$/,
        name: '邮政编码',
        rule:  { pattern: /^\d{6}$/, message: '邮政编码格式不正确，请重新输入'}
    },
    longitude: {
        pattern: /^-?(((1[0-7]\d)|[1-9]?\d)(\.\d+)?|180(\.0+)?)$/,
        name: '经度',
        rule:  { pattern: /^-?(((1[0-7]\d)|[1-9]?\d)(\.\d+)?|180(\.0+)?)$/, message: '经度格式不正确，请输入-180到180之间'}
    },
    latitude: {
        pattern: /^-?([1-8]?\d(\.\d+)?|90(\.0+)?)$/,
        name: '纬度',
        rule:  { pattern: /^-?([1-8]?\d(\.\d+)?|90(\.0+)?)$/, message: '纬度格式不正确，请输入-90到90之间'}
    },
    percent: {
        pattern: /^([1-9]?\d(\.\d+)?|100(\.0+)?)$/,
        name: '百分比',
        rule:  { pattern: /^([1-9]?\d(\.\d+)?|100(\.0+)?)$/, message: '百分比格式不正确，请重新输入'}
    },
    date: {
        pattern: /^\d{4}-\d{2}-\d{2}$/,
        name: '日期',
        rule:  { pattern: /^\d{4}-\d{2}-\d{2}$/, message: '日期格式不正确，请重新选择'}
    },

}
export default validateRules;